Tekla.Structures.Analysis.AnalysisObject.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisObject class.

Tekla.Structures.Analysis.AnalysisObject.AnalysisModelName
Gets or sets the analysis model name.

Tekla.Structures.Analysis.AnalysisObject.ID
Gets or sets the identifier of the analysis object.

Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectType
Gets or sets the type of the analysis object.

Tekla.Structures.Analysis.AnalysisObject.FatherObjectID
Gets or sets the identifier of the father part.

Tekla.Structures.Analysis.AnalysisObject.FatherObjectType
Gets or sets the type of the father object.

Tekla.Structures.Analysis.AnalysisObject.FatherObject2ID
Gets or sets the identifier of the father part.

Tekla.Structures.Analysis.AnalysisObject.FatherObject2Type
Gets or sets the type of the father object.